[
  {
    "cond": "q7=no",
    "advice": "災害時は停電し、情報が途絶えがちです。家族や大切な人と連絡を取り、情報を得るためにも、モバイルバッテリーや手回し充電器を準備しておきましょう。",
    "priority": 2,
    "level": "beginner"
  },
  {
    "cond": "q7=some",
    "advice": "すでにモバイルバッテリーなどを少し準備できているのはとても良いですね。そのうえで、災害時に家族全員が何日間くらいスマホを使えるかをイメージしながら、必要な個数や容量をもう少し整えていきましょう。",
    "priority": 1,
    "level": "beginner"
  },
  {
    "cond": "q8=no",
    "advice": "電気・ガス・水道が止まると、買い物や調理が難しくなります。家族全員が1週間過ごせるだけの水と非常食を確保しておきましょう。 ローリングストック法（普段から消費しながら備える方法）がおすすめです。",
    "priority": 2,
    "level": "beginner"
  },
  {
    "cond": "q8=some",
    "advice": "すでに非常食や水を少し備えているのは、とても良い一歩です。その準備を土台にして、「家族全員が何日過ごせるか」を数えてみて、不足分をローリングストックで少しずつ増やしていきましょう。",
    "priority": 1,
    "level": "beginner"
  },
  {
    "cond": "q10=no",
    "advice": "災害時に家族が一緒にいるとは限りません。集合場所や連絡手段、安否確認の方法など、事前に家族で話し合い、ルールを決めておきましょう。",
    "priority": 2,
    "level": "beginner"
  },
  {
    "cond": "q10=some",
    "advice": "家族と災害について少しでも話したことがあるのは、とても良い取り組みです。次は、集合場所や連絡手段などを具体的に紙に書き出し、冷蔵庫など家族全員が見える場所に貼って共有してみましょう。",
    "priority": 1,
    "level": "beginner"
  },
  {
    "cond": "q11=no",
    "advice": "自分の住む地域にどんな危険があるかを知ることが、防災の第一歩です。自治体が発行しているハザードマップで、水害や土砂災害の危険箇所を確認しておきましょう。",
    "priority": 2,
    "level": "beginner"
  },
  {
    "cond": "q11=some",
    "advice": "ハザードマップを少しでも見たことがあるのは、とても良いスタートです。そのうえで、自宅だけでなく学校や職場、通学・通勤ルートの危険箇所も一緒に確認し、家族と共有しておきましょう。",
    "priority": 1,
    "level": "beginner"
  },
  {
    "cond": "q1=no",
    "advice": "あなたの地域が地震でどれくらい揺れる可能性があるかを知っていますか？ ハザードマップで揺れやすさや液状化のリスクを確認しましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q1=some",
    "advice": "地域の地震リスクについて少しでも意識しているのは、とても良いことです。次のステップとして、地震ハザードマップをじっくり眺め、自宅だけでなく通学・通勤ルートやよく行く場所の揺れやすさも確認してみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q3=no",
    "advice": "地震の際に家具が倒れると、ケガをするだけでなく、避難経路を塞いでしまいます。寝室やリビングの家具はL字金具などで壁に固定しておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q3=some",
    "advice": "家具の固定を一部でも始めているのは、とても良い取り組みです。まだ固定できていない背の高い家具やテレビなどがあれば、優先順位を決めて、少しずつ固定を進めていきましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q4=no",
    "advice": "就寝中に地震が起きても命を守れるよう、寝る場所の近くに倒れてくるような家具や、落ちてくるようなものがないか確認しましょう。就寝場所を安全な環境に整えてください。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q4=some",
    "advice": "寝室の安全について少しでも見直しているのは、素晴らしい行動です。次は、枕元の周りをもう一度チェックして、落ちてきそうな物やガラスの近くを避けるなど、より安全なレイアウトに整えてみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q9=no",
    "advice": "停電は数日間にわたることもあります。懐中電灯やランタン、モバイルバッテリーだけでなく、寒さに備えて、カセットコンロや防寒具を準備しておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q9=some",
    "advice": "懐中電灯やモバイルバッテリーなど、停電への備えを少しでもしているのは、とても心強い準備です。そのうえで、「何日分の停電まで対応できそうか」を考えながら、電池や防寒具など不足しているものを補っていきましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q12=no",
    "advice": "地図で確認した危険な場所を、実際に歩いてみましょう。危険が潜んでいる場所を自分の目で確かめておくことで、災害時の行動が変わります。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q12=some",
    "advice": "危険な場所を少しでも歩いて確認したことがあるのは、とても大切な経験です。次は、撮った写真や気づきをメモにして家族や近所の人と共有し、みんなで避けるルートを考えてみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q13=no",
    "advice": "災害時の避難は時間との勝負です。家族で避難場所とそこまでの安全な経路を事前に確認しておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q13=some",
    "advice": "避難場所や経路を少しでも意識したことがあるのは、とても良いスタートです。今度は実際に、昼と夜の両方の時間帯で歩いてみて、暗さや道の狭さなども確認しておくと、より安心して避難できます。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q14=no",
    "advice": "災害の兆候に気づくためには、日頃からの情報収集が大切です。気象庁や自治体のウェブサイトなどで、雨量や川の水位情報をこまめに確認する習慣をつけましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q14=some",
    "advice": "雨雲レーダーや川の水位などを少しでもチェックしているのは、とても良い習慣です。合わせて、家族のスマホにも同じアプリやサイトを入れておき、警戒レベルが上がったら一緒に確認するようにしてみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q16=no",
    "advice": "避難のタイミングや方法など、家族で共通認識を持つことが重要です。水害・土砂災害時の行動計画について、家族でしっかり話し合っておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q16=some",
    "advice": "水害や土砂災害のときの行動について、家族と少しでも話し合ったことがあるのは素晴らしいです。次は、警戒レベルごとに「いつ家を出るか」「どこに向かうか」を具体的に決め、メモにして共有しておきましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q17=no",
    "advice": "災害時には近所同士の助け合いが不可欠です。自治会や町内会に積極的に参加し、地域の人と顔見知りになっておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q17=some",
    "advice": "自治会や町内会など、地域の活動に少しでも参加しているのは、とても大事な一歩です。年に数回でも、防災訓練や清掃活動などに顔を出しておくと、いざという時に声をかけやすくなります。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q18=no",
    "advice": "近所の人と防災について話すことで、お互いの備えや状況を把握できます。災害時の助け合いを円滑にするため、コミュニケーションをとる機会を増やしましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q18=some",
    "advice": "近所の方と防災の話を少しでもしたことがあるのは、とても心強いつながりです。次は、「うちはこんな備えをしているよ」と具体例を共有し合い、お互いに真似できる工夫を見つけてみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q19=no",
    "advice": "高齢者や障がいを持つ方など、災害時に特別な配慮が必要な人がいます。近隣で手助けが必要な人を把握し、いざという時に助け合える体制を整えましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q19=some",
    "advice": "支援が必要な近所の方の存在を少しでも意識しているのは、とても大切な視点です。無理のない範囲で、「何かあったら声をかけますね」と普段から一言伝えておくと、災害時にも動きやすくなります。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q20=no",
    "advice": "防災訓練は、災害時の行動を体験できる貴重な機会です。地域の防災訓練に積極的に参加し、いざという時に体が動くようにしておきましょう。",
    "priority": 3,
    "level": "intermediate"
  },
  {
    "cond": "q20=some",
    "advice": "防災訓練にたまにでも参加しているのは、とても良い実践です。訓練のあとには、感じた気づきや改善点を家族や友人と共有し、普段の備えにどう生かすかを話し合ってみましょう。",
    "priority": 2,
    "level": "intermediate"
  },
  {
    "cond": "q2=no",
    "advice": "地震の際に家が倒壊するリスクは、命に関わる最も大きな危険です。専門家にご自宅の耐震診断を依頼し、必要に応じて補強工事を検討しましょう。",
    "priority": 4,
    "level": "advanced"
  },
  {
    "cond": "q2=some",
    "advice": "自宅の耐震性について少しでも気にかけているのは、とても重要な視点です。自治体の無料相談や簡易診断など、ハードルの低いサービスから利用し、結果を踏まえて必要な補強を検討してみましょう。",
    "priority": 3,
    "level": "advanced"
  },
  {
    "cond": "q5=no",
    "advice": "地震はいつどこで起こるかわかりません。揺れを感じたら、まずは「頭を守る」行動をすぐに取れるよう、日頃から意識しておきましょう。",
    "priority": 4,
    "level": "advanced"
  },
  {
    "cond": "q5=some",
    "advice": "地震のときに身を守る行動を少しでも意識しているのは、大きな一歩です。机の下に隠れる、頭を守る、揺れが収まるまで無理に動かない、などを家族とロールプレイして、体で覚えておきましょう。",
    "priority": 3,
    "level": "advanced"
  },
  {
    "cond": "q6=no",
    "advice": "海の近くで強い揺れや、弱くても長い揺れを感じた場合、津波が来る可能性があります。「すぐ逃げる」ことを徹底し、事前に確認した高台や頑丈な建物の3階以上へ避難してください。",
    "priority": 4,
    "level": "advanced"
  },
  {
    "cond": "q6=some",
    "advice": "津波からの避難について少しでも考えたことがあるのは、とても心強い備えです。実際に高台や津波避難ビルまで歩いてみて、何分かかるか、どのルートが安全かを確認しておきましょう。",
    "priority": 3,
    "level": "advanced"
  },
  {
    "cond": "q15=no",
    "advice": "道路が冠水して避難経路が断たれた場合、自宅で身を守る必要があります。「垂直避難」（家の2階などへ移動すること）に備えて、2階に飲料水や食料、簡易トイレなどを置いておきましょう。",
    "priority": 4,
    "level": "advanced"
  },
  {
    "cond": "q15=some",
    "advice": "冠水時に自宅で過ごす状況を少しでもイメージできているのは、とても良いことです。自宅の2階など安全な場所に、一晩分の水・食料・ライト・簡易トイレをまとめて置き、すぐに持ち出せるようにしておきましょう。",
    "priority": 3,
    "level": "advanced"
  },
  {
    "cond": "depth>=1.5",
    "advice": "浸水深1.5mは、大人の腰から胸の高さにあたり、歩くのが非常に困難な状態です。命を守るため、ためらわずに今すぐ避難を開始してください。",
    "priority": 5,
    "level": "critical"
  },
  {
    "cond": "depth>0.5 and depth<1.5",
    "advice": "浸水深が0.5mを超えると、車の運転や徒歩での避難が非常に危険になります。今いる場所の状況を再確認し、より安全な場所へ避難する経路を検討してください。",
    "priority": 4,
    "level": "warning"
  },
  {
    "cond": "inventory_days<1",
    "advice": "災害が発生すると、スーパーやコンビニから水や食料がすぐに消え、物流も停止する可能性があります。すぐに水と食料を最低3日分、できれば1週間分、確保してください。",
    "priority": 5,
    "level": "critical"
  },
  {
    "cond": "inventory_days>=1 and inventory_days<3",
    "advice": "災害後の生活を支えるためには、最低でも3日分の備蓄が推奨されています。追加の飲料水や食料、カセットコンロなどの生活用品をリストアップして用意しておきましょう。",
    "priority": 4,
    "level": "warning"
  }
]
